---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTraySizeIterator.CurrentObject
source: html/6355b507-a170-dd9e-df90-ff4a851c7194.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```